(() => {
    'use strict';

    window.EMC = window.EMC || {};

    Object.assign(window.EMC, {
        //マスタ区分
        MASTER_CLASS: [
            '雇用区分',
            '性別区分',
            '国内外区分',
            '給与区分',
            '課税区分',
            '配偶者有無',
            '居住者区分',
            '同居区分',
            '扶養区分',
            '障害者区分',
            '健保扶養区分',
            '寡婦_ひとり親区分',
            '勤労学生区分',
            '災害者区分',
            '外国人区分',
            '社保加入区分',
            '従業員区分',
            '労災保険区分',
            '雇用保険区分',
            '住民税徴収方法',
            '支給間隔',
            '支給方法',
            '支給区分',
            '預金種目',
            '家族_扶養区分',
            '所属区分',
            '給与体系',
            '続柄',
            '休職事由',
        ],
    });
})();
